Revit 2027 API
ParameterTypeId.RbsProjectConstructionTypeShadingfactorParam Property
 "Internal Shading Factor"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsProjectConstructionTypeShadingfactorParam { get; }
Public Shared ReadOnly Property RbsProjectConstructionTypeShadingfactorParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsProjectConstructionTypeShadingfactorParam {
	ForgeTypeId^ get ();
}
static member RbsProjectConstructionTypeShadingfactorParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace